; ModuleID = 'lulesh.cc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%"class.std::ios_base::Init" = type { i8 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Ubuntu clang version 3.8.0-svn257311-1~exp1 (trunk) (based on LLVM 3.8.0)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !12, subprograms: !1148, globals: !1507, imports: !1509)
!1 = !DIFile(filename: "lulesh.cc", directory: "/home/user1/devel/cxt-bitbucket/examples")
!2 = !{!3, !8}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 43, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./lulesh.h", directory: "/home/user1/devel/cxt-bitbucket/examples")
!5 = !{!6, !7}
!6 = !DIEnumerator(name: "VolumeError", value: -1)
!7 = !DIEnumerator(name: "QStopError", value: -2)
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !"_ZTSSt10__are_sameIddE", file: !9, line: 113, size: 32, align: 32, elements: !10, identifier: "_ZTSNSt10__are_sameIddEUt_E")
!9 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/5.3.0/../../../../include/c++/5.3.0/bits/cpp_type_traits.h", directory: "/home/user1/devel/cxt-bitbucket/examples")
!10 = !{!11}
!11 = !DIEnumerator(name: "__value", value: 1)
!12 = !{!13, !19, !28, !30, !37, !39, !41, !45, !57, !321, !476, !490, !533, !577, !594, !618, !620, !623, !679, !680, !681, !682, !829, !843, !881, !925, !942, !966, !967, !970, !1022, !1073, !1074, !116, !1075, !17, !1086, !1087, !118, !1095, !1097, !1099, !80, !76, !429, !721, !338, !1101, !1105, !8, !1108, !1114, !1117, !1120, !1123, !1124, !1132, !1133, !1134, !1138, !1141, !339, !1144, !360, !1145}
!13 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 82, size: 64, align: 32, elements: !15, identifier: "_ZTS11__mbstate_t")
!14 = !DIFile(filename: "/usr/include/wchar.h", directory: "/home/user1/devel/cxt-bitbucket/examples")
!15 = !{!16, !18}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !"_ZTS11__mbstate_t", file: !14, line: 84, baseType: !17, size: 32, align: 32)
!17 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !"_ZTS11__mbstate_t", file: !14, line: 93, baseType: !"_ZTSN11__mbstate_tUt_E", size: 32, align: 32, offset: 32)
!19 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTS11__mbstate_t", file: !14, line: 85, size: 32, align: 32, elements: !20, identifier: "_ZTSN11__mbstate_tUt_E")
!20 = !{!21, !23}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !"_ZTSN11__mbstate_tUt_E", file: !14, line: 88, baseType: !22, size: 32, align: 32)
!22 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !"_ZTSN11__mbstate_tUt_E", file: !14, line: 92, baseType: !24, size: 32, align: 8)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 32, align: 8, elements: !26)
!25 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!26 = !{!27}
!27 = !DISubrange(count: 4)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !29, line: 245, size: 1728, align: 64, flags: DIFlagFwdDecl, identifier: "_ZTS8_IO_FILE")
!29 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/user1/devel/cxt-bitbucket/examples")
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !31, identifier: "_ZTS13__va_list_tag")
!31 = !{!32, !33, !34, !36}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !22, size: 32, align: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !22, size: 32, align: 32, offset: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !35, size: 64, align: 64, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !35, size: 64, align: 64, offset: 128)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !38, line: 133, size: 448, align: 64, flags: DIFlagFwdDecl, identifier: "_ZTS2tm")
!38 = !DIFile(filename: "/usr/include/time.h", directory: "/home/user1/devel/cxt-bitbucket/examples")
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !40, line: 53, size: 768, align: 64, flags: DIFlagFwdDecl, identifier: "_ZTS5lconv")
!40 = !DIFile(filename: "/usr/include/locale.h", directory: "/home/user1/devel/cxt-bitbucket/examples")
!41 = !DICompositeType(tag: DW_TAG_class_type, name: "ios_base", scope: !43, file: !42, line: 228, size: 1728, align: 64, flags: DIFlagFwdDecl, identifier: "_ZTSSt8ios_base")
!42 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/5.3.0/../../../../include/c++/5.3.0/bits/ios_base.h", directory: "/home/user1/devel/cxt-bitbucket/examples")
!43 = !DINamespace(name: "std", scope: null, file: !44, line: 194)
!44 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/5.3.0/../../../../include/x86_64-linux-gnu/c++/5.3.0/bits/c++config.h", directory: "/home/user1/devel/cxt-bitbucket/examples")
!45 = !DICompositeType(tag: DW_TAG_class_type, name: "Init", scope: !"_ZTSSt8ios_base", file: !42, line: 601, size: 8, align: 8, elements: !46, identifier: "_ZTSNSt8ios_base4InitE")
!46 = !{!47, !50, !52, !56}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_S_refcount", scope: !"_ZTSNSt8ios_base4InitE", file: !42, line: 609, baseType: !48, flags: DIFlagStaticMember)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Atomic_word", file: !49, line: 32, baseType: !17)
!49 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/5.3.0/../../../../include/x86_64-linux-gnu/c++/5.3.0/bits/atomic_word.h", directory: "/home/user1/devel/cxt-bitbucket/examples")
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_S_synced_with_stdio", scope: !"_ZTSNSt8ios_base4InitE", file: !42, line: 610, baseType: !51, flags: DIFlagStaticMember)
!51 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!52 = !DISubprogram(name: "Init", scope: !"_ZTSNSt8ios_base4InitE", file: !42, line: 605, type: !53, isLocal: false, isDefinition: false, scopeLine: 605, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!53 = !DISubroutineType(types: !54)
!54 = !{null, !55}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt8ios_base4InitE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!56 = !DISubprogram(name: "~Init", scope: !"_ZTSNSt8ios_base4InitE", file: !42, line: 606, type: !53, isLocal: false, isDefinition: false, scopeLine: 606, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!57 = !DICompositeType(tag: DW_TAG_class_type, name: "Domain", file: !4, line: 127, size: 11648, align: 64, elements: !58, identifier: "_ZTS6Domain")
!58 = !{!59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !77, !78, !81, !82, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !171, !174, !175, !178, !181, !182, !183, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !202, !203, !204, !207, !208, !209, !213, !214, !217, !220, !223, !226, !227, !228, !229, !230, !231, !232, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !285, !286, !287, !288, !289, !290, !291, !292, !293, !296, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !315, !316, !317, !318, !319, !320}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "m_x", scope: !"_ZTS6Domain", file: !4, line: 431, baseType: !"_ZTSSt6vectorIdSaIdEE", size: 192, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "m_y", scope: !"_ZTS6Domain", file: !4, line: 432, baseType: !"_ZTSSt6vectorIdSaIdEE", size: 192, align: 64, offset: 192)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "m_z", scope: !"_ZTS6Domain", file: !4, line: 433, baseType: !"_ZTSSt6vectorIdSaIdEE", size: 192, align: 64, offset: 384)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "m_xd", scope: !"_ZTS6Domain", file: !4, line: 435, baseType: !"_ZTSSt6vectorIdSaIdEE", size: 192, align: 64, offset: 576)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "m_yd", scope: !"_ZTS6Domain", file: !4, line: 436, baseType: !"_ZTSSt6vectorIdSaIdEE", size: 192, align: 64, offset: 768)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "m_zd", scope: !"_ZTS6Domain", file: !4, line: 437, baseType: !"_ZTSSt6vectorIdSaIdEE", size: 192, align: 64, offset: 960)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "m_xdd", scope: !"_ZTS6Domain", file: !4, line: 439, baseType: !"_ZTSSt6vectorIdSaIdEE", size: 192, align: 64, offset: 1152)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "m_ydd", scope: !"_ZTS6Domain", file: !4, line: 440, baseType: !"_ZTSSt6vectorIdSaIdEE", size: 192, align: 64, offset: 1344)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "m_zdd", scope: !"_ZTS6Domain", file: !4, line: 441, baseType: !"_ZTSSt6vectorIdSaIdEE", size: 192, align: 64, offset: 1536)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "m_fx", scope: !"_ZTS6Domain", file: !4, line: 443, baseType: !"_ZTSSt6vectorIdSaIdEE", size: 192, align: 64, offset: 1728)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "m_fy", scope: !"_ZTS6Domain", file: !4, line: 444, baseType: !"_ZTSSt6vectorIdSaIdEE", size: 192, align: 64, offset: 1920)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "m_fz", scope: !"_ZTS6Domain", file: !4, line: 445, baseType: !"_ZTSSt6vectorIdSaIdEE", size: 192, align: 64, offset: 2112)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "m_nodalMass", scope: !"_ZTS6Domain", file: !4, line: 447, baseType: !"_ZTSSt6vectorIdSaIdEE", size: 192, align: 64, offset: 2304)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "m_symmX", scope: !"_ZTS6Domain", file: !4, line: 449, baseType: !"_ZTSSt6vectorIiSaIiEE", size: 192, align: 64, offset: 2496)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "m_symmY", scope: !"_ZTS6Domain", file: !4, line: 450, baseType: !"_ZTSSt6vectorIiSaIiEE", size: 192, align: 64, offset: 2688)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "m_symmZ", scope: !"_ZTS6Domain", file: !4, line: 451, baseType: !"_ZTSSt6vectorIiSaIiEE", size: 192, align: 64, offset: 2880)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "m_numReg", scope: !"_ZTS6Domain", file: !4, line: 456, baseType: !76, size: 32, align: 32, offset: 3072)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "Int_t", file: !4, line: 41, baseType: !17)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "m_cost", scope: !"_ZTS6Domain", file: !4, line: 457, baseType: !76, size: 32, align: 32, offset: 3104)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "m_regElemSize", scope: !"_ZTS6Domain", file: !4, line: 458, baseType: !79, size: 64, align: 64, offset: 3136)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "Index_t", file: !4, line: 39, baseType: !17)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "m_regNumList", scope: !"_ZTS6Domain", file: !4, line: 459, baseType: !79, size: 64, align: 64, offset: 3200)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "m_regElemlist", scope: !"_ZTS6Domain", file: !4, line: 460, baseType: !83, size: 64, align: 64, offset: 3264)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "m_nodelist", scope: !"_ZTS6Domain", file: !4, line: 462, baseType: !"_ZTSSt6vectorIiSaIiEE", size: 192, align: 64, offset: 3328)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "m_lxim", scope: !"_ZTS6Domain", file: !4, line: 464, baseType: !"_ZTSSt6vectorIiSaIiEE", size: 192, align: 64, offset: 3520)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "m_lxip", scope: !"_ZTS6Domain", file: !4, line: 465, baseType: !"_ZTSSt6vectorIiSaIiEE", size: 192, align: 64, offset: 3712)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "m_letam", scope: !"_ZTS6Domain", file: !4, line: 466, baseType: !"_ZTSSt6vectorIiSaIiEE", size: 192, align: 64, offset: 3904)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "m_letap", scope: !"_ZTS6Domain", file: !4, line: 467, baseType: !"_ZTSSt6vectorIiSaIiEE", size: 192, align: 64, offset: 4096)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "m_lzetam", scope: !"_ZTS6Domain", file: !4, line: 468, baseType: !"_ZTSSt6vectorIiSaIiEE", size: 192, align: 64, offset: 4288)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "m_lzetap", scope: !"_ZTS6Domain", file: !4, line: 469, baseType: !"_ZTSSt6vectorIiSaIiEE", size: 192, align: 64, offset: 4480)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "m_elemBC", scope: !"_ZTS6Domain", file: !4, line: 471, baseType: !"_ZTSSt6vectorIiSaIiEE", size: 192, align: 64, offset: 4672)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "m_dxx", scope: !"_ZTS6Domain", file: !4, line: 473, baseType: !"_ZTSSt6vectorIdSaIdEE", size: 192, align: 64, offset: 4864)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "m_dyy", scope: !"_ZTS6Domain", file: !4, line: 474, baseType: !"_ZTSSt6vectorIdSaIdEE", size: 192, align: 64, offset: 5056)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "m_dzz", scope: !"_ZTS6Domain", file: !4, line: 475, baseType: !"_ZTSSt6vectorIdSaIdEE", size: 192, align: 64, offset: 5248)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "m_delv_xi", scope: !"_ZTS6Domain", file: !4, line: 477, baseType: !"_ZTSSt6vectorIdSaIdEE", size: 192, align: 64, offset: 5440)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "m_delv_eta", scope: !"_ZTS6Domain", file: !4, line: 478, baseType: !"_ZTSSt6vectorIdSaIdEE", size: 192, align: 64, offset: 5632)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "m_delv_zeta", scope: !"_ZTS6Domain", file: !4, line: 479, baseType: !"_ZTSSt6vectorIdSaIdEE", size: 192, align: 64, offset: 5824)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "m_delx_xi", scope: !"_ZTS6Domain", file: !4, line: 481, baseType: !"_ZTSSt6vectorIdSaIdEE", size: 192, align: 64, offset: 6016)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "m_delx_eta", scope: !"_ZTS6Domain", file: !4, line: 482, baseType: !"_ZTSSt6vectorIdSaIdEE", size: 192, align: 64, offset: 6208)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "m_delx_zeta", scope: !"_ZTS6Domain", file: !4, line: 483, baseType: !"_ZTSSt6vectorIdSaIdEE", size: 192, align: 64, offset: 6400)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "m_e", scope: !"_ZTS6Domain", file: !4, line: 485, baseType: !"_ZTSSt6vectorIdSaIdEE", size: 192, align: 64, offset: 6592)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "m_p", scope: !"_ZTS6Domain", file: !4, line: 487, baseType: !"_ZTSSt6vectorIdSaIdEE", size: 192, align: 64, offset: 6784)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "m_q", scope: !"_ZTS6Domain", file: !4, line: 488, baseType: !"_ZTSSt6vectorIdSaIdEE", size: 192, align: 64, offset: 6976)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "m_ql", scope: !"_ZTS6Domain", file: !4, line: 489, baseType: !"_ZTSSt6vectorIdSaIdEE", size: 192, align: 64, offset: 7168)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "m_qq", scope: !"_ZTS6Domain", file: !4, line: 490, baseType: !"_ZTSSt6vectorIdSaIdEE", size: 192, align: 64, offset: 7360)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "m_v", scope: !"_ZTS6Domain", file: !4, line: 492, baseType: !"_ZTSSt6vectorIdSaIdEE", size: 192, align: 64, offset: 7552)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "m_volo", scope: !"_ZTS6Domain", file: !4, line: 493, baseType: !"_ZTSSt6vectorIdSaIdEE", size: 192, align: 64, offset: 7744)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "m_vnew", scope: !"_ZTS6Domain", file: !4, line: 494, baseType: !"_ZTSSt6vectorIdSaIdEE", size: 192, align: 64, offset: 7936)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "m_delv", scope: !"_ZTS6Domain", file: !4, line: 495, baseType: !"_ZTSSt6vectorIdSaIdEE", size: 192, align: 64, offset: 8128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "m_vdov", scope: !"_ZTS6Domain", file: !4, line: 496, baseType: !"_ZTSSt6vectorIdSaIdEE", size: 192, align: 64, offset: 8320)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "m_arealg", scope: !"_ZTS6Domain", file: !4, line: 498, baseType: !"_ZTSSt6vectorIdSaIdEE", size: 192, align: 64, offset: 8512)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "m_ss", scope: !"_ZTS6Domain", file: !4, line: 500, baseType: !"_ZTSSt6vectorIdSaIdEE", size: 192, align: 64, offset: 8704)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "m_elemMass", scope: !"_ZTS6Domain", file: !4, line: 502, baseType: !"_ZTSSt6vectorIdSaIdEE", size: 192, align: 64, offset: 8896)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "m_e_cut", scope: !"_ZTS6Domain", file: !4, line: 505, baseType: !115, size: 64, align: 64, offset: 9088)
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real_t", file: !4, line: 40, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "real8", file: !4, line: 36, baseType: !118)
!118 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "m_p_cut", scope: !"_ZTS6Domain", file: !4, line: 506, baseType: !115, size: 64, align: 64, offset: 9152)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "m_q_cut", scope: !"_ZTS6Domain", file: !4, line: 507, baseType: !115, size: 64, align: 64, offset: 9216)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "m_v_cut", scope: !"_ZTS6Domain", file: !4, line: 508, baseType: !115, size: 64, align: 64, offset: 9280)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "m_u_cut", scope: !"_ZTS6Domain", file: !4, line: 509, baseType: !115, size: 64, align: 64, offset: 9344)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "m_hgcoef", scope: !"_ZTS6Domain", file: !4, line: 513, baseType: !115, size: 64, align: 64, offset: 9408)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "m_ss4o3", scope: !"_ZTS6Domain", file: !4, line: 514, baseType: !115, size: 64, align: 64, offset: 9472)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "m_qstop", scope: !"_ZTS6Domain", file: !4, line: 515, baseType: !115, size: 64, align: 64, offset: 9536)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "m_monoq_max_slope", scope: !"_ZTS6Domain", file: !4, line: 516, baseType: !115, size: 64, align: 64, offset: 9600)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "m_monoq_limiter_mult", scope: !"_ZTS6Domain", file: !4, line: 517, baseType: !115, size: 64, align: 64, offset: 9664)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "m_qlc_monoq", scope: !"_ZTS6Domain", file: !4, line: 518, baseType: !115, size: 64, align: 64, offset: 9728)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "m_qqc_monoq", scope: !"_ZTS6Domain", file: !4, line: 519, baseType: !115, size: 64, align: 64, offset: 9792)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "m_qqc", scope: !"_ZTS6Domain", file: !4, line: 520, baseType: !115, size: 64, align: 64, offset: 9856)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "m_eosvmax", scope: !"_ZTS6Domain", file: !4, line: 521, baseType: !115, size: 64, align: 64, offset: 9920)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "m_eosvmin", scope: !"_ZTS6Domain", file: !4, line: 522, baseType: !115, size: 64, align: 64, offset: 9984)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "m_pmin", scope: !"_ZTS6Domain", file: !4, line: 523, baseType: !115, size: 64, align: 64, offset: 10048)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "m_emin", scope: !"_ZTS6Domain", file: !4, line: 524, baseType: !115, size: 64, align: 64, offset: 10112)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "m_dvovmax", scope: !"_ZTS6Domain", file: !4, line: 525, baseType: !115, size: 64, align: 64, offset: 10176)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "m_refdens", scope: !"_ZTS6Domain", file: !4, line: 526, baseType: !115, size: 64, align: 64, offset: 10240)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "m_dtcourant", scope: !"_ZTS6Domain", file: !4, line: 529, baseType: !116, size: 64, align: 64, offset: 10304)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "m_dthydro", scope: !"_ZTS6Domain", file: !4, line: 530, baseType: !116, size: 64, align: 64, offset: 10368)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "m_cycle", scope: !"_ZTS6Domain", file: !4, line: 531, baseType: !76, size: 32, align: 32, offset: 10432)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "m_dtfixed", scope: !"_ZTS6Domain", file: !4, line: 532, baseType: !116, size: 64, align: 64, offset: 10496)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "m_time", scope: !"_ZTS6Domain", file: !4, line: 533, baseType: !116, size: 64, align: 64, offset: 10560)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "m_deltatime", scope: !"_ZTS6Domain", file: !4, line: 534, baseType: !116, size: 64, align: 64, offset: 10624)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "m_deltatimemultlb", scope: !"_ZTS6Domain", file: !4, line: 535, baseType: !116, size: 64, align: 64, offset: 10688)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "m_deltatimemultub", scope: !"_ZTS6Domain", file: !4, line: 536, baseType: !116, size: 64, align: 64, offset: 10752)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "m_dtmax", scope: !"_ZTS6Domain", file: !4, line: 537, baseType: !116, size: 64, align: 64, offset: 10816)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "m_stoptime", scope: !"_ZTS6Domain", file: !4, line: 538, baseType: !116, size: 64, align: 64, offset: 10880)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "m_numRanks", scope: !"_ZTS6Domain", file: !4, line: 541, baseType: !76, size: 32, align: 32, offset: 10944)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "m_colLoc", scope: !"_ZTS6Domain", file: !4, line: 543, baseType: !80, size: 32, align: 32, offset: 10976)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "m_rowLoc", scope: !"_ZTS6Domain", file: !4, line: 544, baseType: !80, size: 32, align: 32, offset: 11008)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "m_planeLoc", scope: !"_ZTS6Domain", file: !4, line: 545, baseType: !80, size: 32, align: 32, offset: 11040)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "m_tp", scope: !"_ZTS6Domain", file: !4, line: 546, baseType: !80, size: 32, align: 32, offset: 11072)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "m_sizeX", scope: !"_ZTS6Domain", file: !4, line: 548, baseType: !80, size: 32, align: 32, offset: 11104)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "m_sizeY", scope: !"_ZTS6Domain", file: !4, line: 549, baseType: !80, size: 32, align: 32, offset: 11136)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "m_sizeZ", scope: !"_ZTS6Domain", file: !4, line: 550, baseType: !80, size: 32, align: 32, offset: 11168)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "m_numElem", scope: !"_ZTS6Domain", file: !4, line: 551, baseType: !80, size: 32, align: 32, offset: 11200)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "m_numNode", scope: !"_ZTS6Domain", file: !4, line: 552, baseType: !80, size: 32, align: 32, offset: 11232)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "m_maxPlaneSize", scope: !"_ZTS6Domain", file: !4, line: 554, baseType: !80, size: 32, align: 32, offset: 11264)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "m_maxEdgeSize", scope: !"_ZTS6Domain", file: !4, line: 555, baseType: !80, size: 32, align: 32, offset: 11296)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "m_nodeElemStart", scope: !"_ZTS6Domain", file: !4, line: 558, baseType: !79, size: 64, align: 64, offset: 11328)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "m_nodeElemCornerList", scope: !"_ZTS6Domain", file: !4, line: 559, baseType: !79, size: 64, align: 64, offset: 11392)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "m_rowMin", scope: !"_ZTS6Domain", file: !4, line: 562, baseType: !80, size: 32, align: 32, offset: 11456)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "m_rowMax", scope: !"_ZTS6Domain", file: !4, line: 562, baseType: !80, size: 32, align: 32, offset: 11488)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "m_colMin", scope: !"_ZTS6Domain", file: !4, line: 563, baseType: !80, size: 32, align: 32, offset: 11520)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "m_colMax", scope: !"_ZTS6Domain", file: !4, line: 563, baseType: !80, size: 32, align: 32, offset: 11552)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "m_planeMin", scope: !"_ZTS6Domain", file: !4, line: 564, baseType: !80, size: 32, align: 32, offset: 11584)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "m_planeMax", scope: !"_ZTS6Domain", file: !4, line: 564, baseType: !80, size: 32, align: 32, offset: 11616)
!167 = !DISubprogram(name: "Domain", scope: !"_ZTS6Domain", file: !4, line: 132, type: !168, isLocal: false, isDefinition: false, scopeLine: 132, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!168 = !DISubroutineType(types: !169)
!169 = !{null, !170, !76, !80, !80, !80, !80, !76, !76, !76, !76}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS6Domain", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!171 = !DISubprogram(name: "AllocateNodePersistent", linkageName: "_ZN6Domain22AllocateNodePersistentEi", scope: !"_ZTS6Domain", file: !4, line: 140, type: !172, isLocal: false, isDefinition: false, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!172 = !DISubroutineType(types: !173)
!173 = !{null, !170, !76}
!174 = !DISubprogram(name: "AllocateElemPersistent", linkageName: "_ZN6Domain22AllocateElemPersistentEi", scope: !"_ZTS6Domain", file: !4, line: 161, type: !172, isLocal: false, isDefinition: false, scopeLine: 161, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!175 = !DISubprogram(name: "AllocateGradients", linkageName: "_ZN6Domain17AllocateGradientsEii", scope: !"_ZTS6Domain", file: !4, line: 195, type: !176, isLocal: false, isDefinition: false, scopeLine: 195, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!176 = !DISubroutineType(types: !177)
!177 = !{null, !170, !76, !76}
!178 = !DISubprogram(name: "DeallocateGradients", linkageName: "_ZN6Domain19DeallocateGradientsEv", scope: !"_ZTS6Domain", file: !4, line: 208, type: !179, isLocal: false, isDefinition: false, scopeLine: 208, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!179 = !DISubroutineType(types: !180)
!180 = !{null, !170}
!181 = !DISubprogram(name: "AllocateStrains", linkageName: "_ZN6Domain15AllocateStrainsEi", scope: !"_ZTS6Domain", file: !4, line: 219, type: !172, isLocal: false, isDefinition: false, scopeLine: 219, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!182 = !DISubprogram(name: "DeallocateStrains", linkageName: "_ZN6Domain17DeallocateStrainsEv", scope: !"_ZTS6Domain", file: !4, line: 226, type: !179, isLocal: false, isDefinition: false, scopeLine: 226, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!183 = !DISubprogram(name: "x", linkageName: "_ZN6Domain1xEi", scope: !"_ZTS6Domain", file: !4, line: 240, type: !184, isLocal: false, isDefinition: false, scopeLine: 240, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!184 = !DISubroutineType(types: !185)
!185 = !{!186, !170, !80}
!186 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !116, size: 64, align: 64)
!187 = !DISubprogram(name: "y", linkageName: "_ZN6Domain1yEi", scope: !"_ZTS6Domain", file: !4, line: 241, type: !184, isLocal: false, isDefinition: false, scopeLine: 241, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!188 = !DISubprogram(name: "z", linkageName: "_ZN6Domain1zEi", scope: !"_ZTS6Domain", file: !4, line: 242, type: !184, isLocal: false, isDefinition: false, scopeLine: 242, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!189 = !DISubprogram(name: "xd", linkageName: "_ZN6Domain2xdEi", scope: !"_ZTS6Domain", file: !4, line: 245, type: !184, isLocal: false, isDefinition: false, scopeLine: 245, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!190 = !DISubprogram(name: "yd", linkageName: "_ZN6Domain2ydEi", scope: !"_ZTS6Domain", file: !4, line: 246, type: !184, isLocal: false, isDefinition: false, scopeLine: 246, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!191 = !DISubprogram(name: "zd", linkageName: "_ZN6Domain2zdEi", scope: !"_ZTS6Domain", file: !4, line: 247, type: !184, isLocal: false, isDefinition: false, scopeLine: 247, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!192 = !DISubprogram(name: "xdd", linkageName: "_ZN6Domain3xddEi", scope: !"_ZTS6Domain", file: !4, line: 250, type: !184, isLocal: false, isDefinition: false, scopeLine: 250, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!193 = !DISubprogram(name: "ydd", linkageName: "_ZN6Domain3yddEi", scope: !"_ZTS6Domain", file: !4, line: 251, type: !184, isLocal: false, isDefinition: false, scopeLine: 251, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!194 = !DISubprogram(name: "zdd", linkageName: "_ZN6Domain3zddEi", scope: !"_ZTS6Domain", file: !4, line: 252, type: !184, isLocal: false, isDefinition: false, scopeLine: 252, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!195 = !DISubprogram(name: "fx", linkageName: "_ZN6Domain2fxEi", scope: !"_ZTS6Domain", file: !4, line: 255, type: !184, isLocal: false, isDefinition: false, scopeLine: 255, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!196 = !DISubprogram(name: "fy", linkageName: "_ZN6Domain2fyEi", scope: !"_ZTS6Domain", file: !4, line: 256, type: !184, isLocal: false, isDefinition: false, scopeLine: 256, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!197 = !DISubprogram(name: "fz", linkageName: "_ZN6Domain2fzEi", scope: !"_ZTS6Domain", file: !4, line: 257, type: !184, isLocal: false, isDefinition: false, scopeLine: 257, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!198 = !DISubprogram(name: "nodalMass", linkageName: "_ZN6Domain9nodalMassEi", scope: !"_ZTS6Domain", file: !4, line: 260, type: !184, isLocal: false, isDefinition: false, scopeLine: 260, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!199 = !DISubprogram(name: "symmX", linkageName: "_ZN6Domain5symmXEi", scope: !"_ZTS6Domain", file: !4, line: 263, type: !200, isLocal: false, isDefinition: false, scopeLine: 263, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!200 = !DISubroutineType(types: !201)
!201 = !{!80, !170, !80}
!202 = !DISubprogram(name: "symmY", linkageName: "_ZN6Domain5symmYEi", scope: !"_ZTS6Domain", file: !4, line: 264, type: !200, isLocal: false, isDefinition: false, scopeLine: 264, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!203 = !DISubprogram(name: "symmZ", linkageName: "_ZN6Domain5symmZEi", scope: !"_ZTS6Domain", file: !4, line: 265, type: !200, isLocal: false, isDefinition: false, scopeLine: 265, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!204 = !DISubprogram(name: "symmXempty", linkageName: "_ZN6Domain10symmXemptyEv", scope: !"_ZTS6Domain", file: !4, line: 266, type: !205, isLocal: false, isDefinition: false, scopeLine: 266, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!205 = !DISubroutineType(types: !206)
!206 = !{!51, !170}
!207 = !DISubprogram(name: "symmYempty", linkageName: "_ZN6Domain10symmYemptyEv", scope: !"_ZTS6Domain", file: !4, line: 267, type: !205, isLocal: false, isDefinition: false, scopeLine: 267, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!208 = !DISubprogram(name: "symmZempty", linkageName: "_ZN6Domain10symmZemptyEv", scope: !"_ZTS6Domain", file: !4, line: 268, type: !205, isLocal: false, isDefinition: false, scopeLine: 268, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!209 = !DISubprogram(name: "regElemSize", linkageName: "_ZN6Domain11regElemSizeEi", scope: !"_ZTS6Domain", file: !4, line: 273, type: !210, isLocal: false, isDefinition: false, scopeLine: 273, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!210 = !DISubroutineType(types: !211)
!211 = !{!212, !170, !80}
!212 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !80, size: 64, align: 64)
!213 = !DISubprogram(name: "regNumList", linkageName: "_ZN6Domain10regNumListEi", scope: !"_ZTS6Domain", file: !4, line: 274, type: !210, isLocal: false, isDefinition: false, scopeLine: 274, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!214 = !DISubprogram(name: "regNumList", linkageName: "_ZN6Domain10regNumListEv", scope: !"_ZTS6Domain", file: !4, line: 275, type: !215, isLocal: false, isDefinition: false, scopeLine: 275, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!215 = !DISubroutineType(types: !216)
!216 = !{!79, !170}
!217 = !DISubprogram(name: "regElemlist", linkageName: "_ZN6Domain11regElemlistEi", scope: !"_ZTS6Domain", file: !4, line: 276, type: !218, isLocal: false, isDefinition: false, scopeLine: 276, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!218 = !DISubroutineType(types: !219)
!219 = !{!79, !170, !76}
!220 = !DISubprogram(name: "regElemlist", linkageName: "_ZN6Domain11regElemlistEii", scope: !"_ZTS6Domain", file: !4, line: 277, type: !221, isLocal: false, isDefinition: false, scopeLine: 277, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!221 = !DISubroutineType(types: !222)
!222 = !{!212, !170, !76, !80}
!223 = !DISubprogram(name: "nodelist", linkageName: "_ZN6Domain8nodelistEi", scope: !"_ZTS6Domain", file: !4, line: 279, type: !224, isLocal: false, isDefinition: false, scopeLine: 279, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!224 = !DISubroutineType(types: !225)
!225 = !{!79, !170, !80}
!226 = !DISubprogram(name: "lxim", linkageName: "_ZN6Domain4lximEi", scope: !"_ZTS6Domain", file: !4, line: 282, type: !210, isLocal: false, isDefinition: false, scopeLine: 282, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!227 = !DISubprogram(name: "lxip", linkageName: "_ZN6Domain4lxipEi", scope: !"_ZTS6Domain", file: !4, line: 283, type: !210, isLocal: false, isDefinition: false, scopeLine: 283, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!228 = !DISubprogram(name: "letam", linkageName: "_ZN6Domain5letamEi", scope: !"_ZTS6Domain", file: !4, line: 284, type: !210, isLocal: false, isDefinition: false, scopeLine: 284, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!229 = !DISubprogram(name: "letap", linkageName: "_ZN6Domain5letapEi", scope: !"_ZTS6Domain", file: !4, line: 285, type: !210, isLocal: false, isDefinition: false, scopeLine: 285, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!230 = !DISubprogram(name: "lzetam", linkageName: "_ZN6Domain6lzetamEi", scope: !"_ZTS6Domain", file: !4, line: 286, type: !210, isLocal: false, isDefinition: false, scopeLine: 286, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!231 = !DISubprogram(name: "lzetap", linkageName: "_ZN6Domain6lzetapEi", scope: !"_ZTS6Domain", file: !4, line: 287, type: !210, isLocal: false, isDefinition: false, scopeLine: 287, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!232 = !DISubprogram(name: "elemBC", linkageName: "_ZN6Domain6elemBCEi", scope: !"_ZTS6Domain", file: !4, line: 290, type: !233, isLocal: false, isDefinition: false, scopeLine: 290, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!233 = !DISubroutineType(types: !234)
!234 = !{!235, !170, !80}
!235 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !76, size: 64, align: 64)
!236 = !DISubprogram(name: "dxx", linkageName: "_ZN6Domain3dxxEi", scope: !"_ZTS6Domain", file: !4, line: 293, type: !184, isLocal: false, isDefinition: false, scopeLine: 293, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!237 = !DISubprogram(name: "dyy", linkageName: "_ZN6Domain3dyyEi", scope: !"_ZTS6Domain", file: !4, line: 294, type: !184, isLocal: false, isDefinition: false, scopeLine: 294, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!238 = !DISubprogram(name: "dzz", linkageName: "_ZN6Domain3dzzEi", scope: !"_ZTS6Domain", file: !4, line: 295, type: !184, isLocal: false, isDefinition: false, scopeLine: 295, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!239 = !DISubprogram(name: "delv_xi", linkageName: "_ZN6Domain7delv_xiEi", scope: !"_ZTS6Domain", file: !4, line: 298, type: !184, isLocal: false, isDefinition: false, scopeLine: 298, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!240 = !DISubprogram(name: "delv_eta", linkageName: "_ZN6Domain8delv_etaEi", scope: !"_ZTS6Domain", file: !4, line: 299, type: !184, isLocal: false, isDefinition: false, scopeLine: 299, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!241 = !DISubprogram(name: "delv_zeta", linkageName: "_ZN6Domain9delv_zetaEi", scope: !"_ZTS6Domain", file: !4, line: 300, type: !184, isLocal: false, isDefinition: false, scopeLine: 300, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!242 = !DISubprogram(name: "delx_xi", linkageName: "_ZN6Domain7delx_xiEi", scope: !"_ZTS6Domain", file: !4, line: 303, type: !184, isLocal: false, isDefinition: false, scopeLine: 303, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!243 = !DISubprogram(name: "delx_eta", linkageName: "_ZN6Domain8delx_etaEi", scope: !"_ZTS6Domain", file: !4, line: 304, type: !184, isLocal: false, isDefinition: false, scopeLine: 304, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!244 = !DISubprogram(name: "delx_zeta", linkageName: "_ZN6Domain9delx_zetaEi", scope: !"_ZTS6Domain", file: !4, line: 305, type: !184, isLocal: false, isDefinition: false, scopeLine: 305, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!245 = !DISubprogram(name: "e", linkageName: "_ZN6Domain1eEi", scope: !"_ZTS6Domain", file: !4, line: 308, type: !184, isLocal: false, isDefinition: false, scopeLine: 308, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!246 = !DISubprogram(name: "p", linkageName: "_ZN6Domain1pEi", scope: !"_ZTS6Domain", file: !4, line: 311, type: !184, isLocal: false, isDefinition: false, scopeLine: 311, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!247 = !DISubprogram(name: "q", linkageName: "_ZN6Domain1qEi", scope: !"_ZTS6Domain", file: !4, line: 314, type: !184, isLocal: false, isDefinition: false, scopeLine: 314, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!248 = !DISubprogram(name: "ql", linkageName: "_ZN6Domain2qlEi", scope: !"_ZTS6Domain", file: !4, line: 317, type: !184, isLocal: false, isDefinition: false, scopeLine: 317, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!249 = !DISubprogram(name: "qq", linkageName: "_ZN6Domain2qqEi", scope: !"_ZTS6Domain", file: !4, line: 319, type: !184, isLocal: false, isDefinition: false, scopeLine: 319, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!250 = !DISubprogram(name: "v", linkageName: "_ZN6Domain1vEi", scope: !"_ZTS6Domain", file: !4, line: 322, type: !184, isLocal: false, isDefinition: false, scopeLine: 322, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!251 = !DISubprogram(name: "delv", linkageName: "_ZN6Domain4delvEi", scope: !"_ZTS6Domain", file: !4, line: 323, type: !184, isLocal: false, isDefinition: false, scopeLine: 323, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!252 = !DISubprogram(name: "volo", linkageName: "_ZN6Domain4voloEi", scope: !"_ZTS6Domain", file: !4, line: 326, type: !184, isLocal: false, isDefinition: false, scopeLine: 326, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!253 = !DISubprogram(name: "vdov", linkageName: "_ZN6Domain4vdovEi", scope: !"_ZTS6Domain", file: !4, line: 329, type: !184, isLocal: false, isDefinition: false, scopeLine: 329, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!254 = !DISubprogram(name: "arealg", linkageName: "_ZN6Domain6arealgEi", scope: !"_ZTS6Domain", file: !4, line: 332, type: !184, isLocal: false, isDefinition: false, scopeLine: 332, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!255 = !DISubprogram(name: "ss", linkageName: "_ZN6Domain2ssEi", scope: !"_ZTS6Domain", file: !4, line: 335, type: !184, isLocal: false, isDefinition: false, scopeLine: 335, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!256 = !DISubprogram(name: "elemMass", linkageName: "_ZN6Domain8elemMassEi", scope: !"_ZTS6Domain", file: !4, line: 338, type: !184, isLocal: false, isDefinition: false, scopeLine: 338, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!257 = !DISubprogram(name: "nodeElemCount", linkageName: "_ZN6Domain13nodeElemCountEi", scope: !"_ZTS6Domain", file: !4, line: 340, type: !200, isLocal: false, isDefinition: false, scopeLine: 340, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!258 = !DISubprogram(name: "nodeElemCornerList", linkageName: "_ZN6Domain18nodeElemCornerListEi", scope: !"_ZTS6Domain", file: !4, line: 343, type: !224, isLocal: false, isDefinition: false, scopeLine: 343, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!259 = !DISubprogram(name: "u_cut", linkageName: "_ZNK6Domain5u_cutEv", scope: !"_ZTS6Domain", file: !4, line: 349, type: !260, isLocal: false, isDefinition: false, scopeLine: 349, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!260 = !DISubroutineType(types: !261)
!261 = !{!116, !262}
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTS6Domain")
!264 = !DISubprogram(name: "e_cut", linkageName: "_ZNK6Domain5e_cutEv", scope: !"_ZTS6Domain", file: !4, line: 350, type: !260, isLocal: false, isDefinition: false, scopeLine: 350, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!265 = !DISubprogram(name: "p_cut", linkageName: "_ZNK6Domain5p_cutEv", scope: !"_ZTS6Domain", file: !4, line: 351, type: !260, isLocal: false, isDefinition: false, scopeLine: 351, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!266 = !DISubprogram(name: "q_cut", linkageName: "_ZNK6Domain5q_cutEv", scope: !"_ZTS6Domain", file: !4, line: 352, type: !260, isLocal: false, isDefinition: false, scopeLine: 352, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!267 = !DISubprogram(name: "v_cut", linkageName: "_ZNK6Domain5v_cutEv", scope: !"_ZTS6Domain", file: !4, line: 353, type: !260, isLocal: false, isDefinition: false, scopeLine: 353, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!268 = !DISubprogram(name: "hgcoef", linkageName: "_ZNK6Domain6hgcoefEv", scope: !"_ZTS6Domain", file: !4, line: 356, type: !260, isLocal: false, isDefinition: false, scopeLine: 356, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!269 = !DISubprogram(name: "qstop", linkageName: "_ZNK6Domain5qstopEv", scope: !"_ZTS6Domain", file: !4, line: 357, type: !260, isLocal: false, isDefinition: false, scopeLine: 357, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!270 = !DISubprogram(name: "monoq_max_slope", linkageName: "_ZNK6Domain15monoq_max_slopeEv", scope: !"_ZTS6Domain", file: !4, line: 358, type: !260, isLocal: false, isDefinition: false, scopeLine: 358, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!271 = !DISubprogram(name: "monoq_limiter_mult", linkageName: "_ZNK6Domain18monoq_limiter_multEv", scope: !"_ZTS6Domain", file: !4, line: 359, type: !260, isLocal: false, isDefinition: false, scopeLine: 359, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!272 = !DISubprogram(name: "ss4o3", linkageName: "_ZNK6Domain5ss4o3Ev", scope: !"_ZTS6Domain", file: !4, line: 360, type: !260, isLocal: false, isDefinition: false, scopeLine: 360, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!273 = !DISubprogram(name: "qlc_monoq", linkageName: "_ZNK6Domain9qlc_monoqEv", scope: !"_ZTS6Domain", file: !4, line: 361, type: !260, isLocal: false, isDefinition: false, scopeLine: 361, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!274 = !DISubprogram(name: "qqc_monoq", linkageName: "_ZNK6Domain9qqc_monoqEv", scope: !"_ZTS6Domain", file: !4, line: 362, type: !260, isLocal: false, isDefinition: false, scopeLine: 362, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!275 = !DISubprogram(name: "qqc", linkageName: "_ZNK6Domain3qqcEv", scope: !"_ZTS6Domain", file: !4, line: 363, type: !260, isLocal: false, isDefinition: false, scopeLine: 363, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!276 = !DISubprogram(name: "eosvmax", linkageName: "_ZNK6Domain7eosvmaxEv", scope: !"_ZTS6Domain", file: !4, line: 365, type: !260, isLocal: false, isDefinition: false, scopeLine: 365, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!277 = !DISubprogram(name: "eosvmin", linkageName: "_ZNK6Domain7eosvminEv", scope: !"_ZTS6Domain", file: !4, line: 366, type: !260, isLocal: false, isDefinition: false, scopeLine: 366, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!278 = !DISubprogram(name: "pmin", linkageName: "_ZNK6Domain4pminEv", scope: !"_ZTS6Domain", file: !4, line: 367, type: !260, isLocal: false, isDefinition: false, scopeLine: 367, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!279 = !DISubprogram(name: "emin", linkageName: "_ZNK6Domain4eminEv", scope: !"_ZTS6Domain", file: !4, line: 368, type: !260, isLocal: false, isDefinition: false, scopeLine: 368, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!280 = !DISubprogram(name: "dvovmax", linkageName: "_ZNK6Domain7dvovmaxEv", scope: !"_ZTS6Domain", file: !4, line: 369, type: !260, isLocal: false, isDefinition: false, scopeLine: 369, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!281 = !DISubprogram(name: "refdens", linkageName: "_ZNK6Domain7refdensEv", scope: !"_ZTS6Domain", file: !4, line: 370, type: !260, isLocal: false, isDefinition: false, scopeLine: 370, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!282 = !DISubprogram(name: "time", linkageName: "_ZN6Domain4timeEv", scope: !"_ZTS6Domain", file: !4, line: 373, type: !283, isLocal: false, isDefinition: false, scopeLine: 373, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!283 = !DISubroutineType(types: !284)
!284 = !{!186, !170}
!285 = !DISubprogram(name: "deltatime", linkageName: "_ZN6Domain9deltatimeEv", scope: !"_ZTS6Domain", file: !4, line: 374, type: !283, isLocal: false, isDefinition: false, scopeLine: 374, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!286 = !DISubprogram(name: "deltatimemultlb", linkageName: "_ZN6Domain15deltatimemultlbEv", scope: !"_ZTS6Domain", file: !4, line: 375, type: !283, isLocal: false, isDefinition: false, scopeLine: 375, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!287 = !DISubprogram(name: "deltatimemultub", linkageName: "_ZN6Domain15deltatimemultubEv", scope: !"_ZTS6Domain", file: !4, line: 376, type: !283, isLocal: false, isDefinition: false, scopeLine: 376, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!288 = !DISubprogram(name: "stoptime", linkageName: "_ZN6Domain8stoptimeEv", scope: !"_ZTS6Domain", file: !4, line: 377, type: !283, isLocal: false, isDefinition: false, scopeLine: 377, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!289 = !DISubprogram(name: "dtcourant", linkageName: "_ZN6Domain9dtcourantEv", scope: !"_ZTS6Domain", file: !4, line: 378, type: !283, isLocal: false, isDefinition: false, scopeLine: 378, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!290 = !DISubprogram(name: "dthydro", linkageName: "_ZN6Domain7dthydroEv", scope: !"_ZTS6Domain", file: !4, line: 379, type: !283, isLocal: false, isDefinition: false, scopeLine: 379, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!291 = !DISubprogram(name: "dtmax", linkageName: "_ZN6Domain5dtmaxEv", scope: !"_ZTS6Domain", file: !4, line: 380, type: !283, isLocal: false, isDefinition: false, scopeLine: 380, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!292 = !DISubprogram(name: "dtfixed", linkageName: "_ZN6Domain7dtfixedEv", scope: !"_ZTS6Domain", file: !4, line: 381, type: !283, isLocal: false, isDefinition: false, scopeLine: 381, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!293 = !DISubprogram(name: "cycle", linkageName: "_ZN6Domain5cycleEv", scope: !"_ZTS6Domain", file: !4, line: 383, type: !294, isLocal: false, isDefinition: false, scopeLine: 383, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!294 = !DISubroutineType(types: !295)
!295 = !{!235, !170}
!296 = !DISubprogram(name: "numRanks", linkageName: "_ZN6Domain8numRanksEv", scope: !"_ZTS6Domain", file: !4, line: 384, type: !297, isLocal: false, isDefinition: false, scopeLine: 384, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!297 = !DISubroutineType(types: !298)
!298 = !{!212, !170}
!299 = !DISubprogram(name: "colLoc", linkageName: "_ZN6Domain6colLocEv", scope: !"_ZTS6Domain", file: !4, line: 386, type: !297, isLocal: false, isDefinition: false, scopeLine: 386, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!300 = !DISubprogram(name: "rowLoc", linkageName: "_ZN6Domain6rowLocEv", scope: !"_ZTS6Domain", file: !4, line: 387, type: !297, isLocal: false, isDefinition: false, scopeLine: 387, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!301 = !DISubprogram(name: "planeLoc", linkageName: "_ZN6Domain8planeLocEv", scope: !"_ZTS6Domain", file: !4, line: 388, type: !297, isLocal: false, isDefinition: false, scopeLine: 388, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!302 = !DISubprogram(name: "tp", linkageName: "_ZN6Domain2tpEv", scope: !"_ZTS6Domain", file: !4, line: 389, type: !297, isLocal: false, isDefinition: false, scopeLine: 389, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!303 = !DISubprogram(name: "sizeX", linkageName: "_ZN6Domain5sizeXEv", scope: !"_ZTS6Domain", file: !4, line: 391, type: !297, isLocal: false, isDefinition: false, scopeLine: 391, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!304 = !DISubprogram(name: "sizeY", linkageName: "_ZN6Domain5sizeYEv", scope: !"_ZTS6Domain", file: !4, line: 392, type: !297, isLocal: false, isDefinition: false, scopeLine: 392, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!305 = !DISubprogram(name: "sizeZ", linkageName: "_ZN6Domain5sizeZEv", scope: !"_ZTS6Domain", file: !4, line: 393, type: !297, isLocal: false, isDefinition: false, scopeLine: 393, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!306 = !DISubprogram(name: "numReg", linkageName: "_ZN6Domain6numRegEv", scope: !"_ZTS6Domain", file: !4, line: 394, type: !297, isLocal: false, isDefinition: false, scopeLine: 394, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!307 = !DISubprogram(name: "cost", linkageName: "_ZN6Domain4costEv", scope: !"_ZTS6Domain", file: !4, line: 395, type: !294, isLocal: false, isDefinition: false, scopeLine: 395, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!308 = !DISubprogram(name: "numElem", linkageName: "_ZN6Domain7numElemEv", scope: !"_ZTS6Domain", file: !4, line: 396, type: !297, isLocal: false, isDefinition: false, scopeLine: 396, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!309 = !DISubprogram(name: "numNode", linkageName: "_ZN6Domain7numNodeEv", scope: !"_ZTS6Domain", file: !4, line: 397, type: !297, isLocal: false, isDefinition: false, scopeLine: 397, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!310 = !DISubprogram(name: "maxPlaneSize", linkageName: "_ZN6Domain12maxPlaneSizeEv", scope: !"_ZTS6Domain", file: !4, line: 399, type: !297, isLocal: false, isDefinition: false, scopeLine: 399, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!311 = !DISubprogram(name: "maxEdgeSize", linkageName: "_ZN6Domain11maxEdgeSizeEv", scope: !"_ZTS6Domain", file: !4, line: 400, type: !297, isLocal: false, isDefinition: false, scopeLine: 400, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!312 = !DISubprogram(name: "BuildMesh", linkageName: "_ZN6Domain9BuildMeshEiii", scope: !"_ZTS6Domain", file: !4, line: 418, type: !313, isLocal: false, isDefinition: false, scopeLine: 418, flags: DIFlagPrototyped, isOptimized: false)
!313 = !DISubroutineType(types: !314)
!314 = !{null, !170, !76, !76, !76}
!315 = !DISubprogram(name: "SetupThreadSupportStructures", linkageName: "_ZN6Domain28SetupThreadSupportStructuresEv", scope: !"_ZTS6Domain", file: !4, line: 419, type: !179, isLocal: false, isDefinition: false, scopeLine: 419, flags: DIFlagPrototyped, isOptimized: false)
!316 = !DISubprogram(name: "CreateRegionIndexSets", linkageName: "_ZN6Domain21CreateRegionIndexSetsEii", scope: !"_ZTS6Domain", file: !4, line: 420, type: !176, isLocal: false, isDefinition: false, scopeLine: 420, flags: DIFlagPrototyped, isOptimized: false)
!317 = !DISubprogram(name: "SetupCommBuffers", linkageName: "_ZN6Domain16SetupCommBuffersEi", scope: !"_ZTS6Domain", file: !4, line: 421, type: !172, isLocal: false, isDefinition: false, scopeLine: 421, flags: DIFlagPrototyped, isOptimized: false)
!318 = !DISubprogram(name: "SetupSymmetryPlanes", linkageName: "_ZN6Domain19SetupSymmetryPlanesEi", scope: !"_ZTS6Domain", file: !4, line: 422, type: !172, isLocal: false, isDefinition: false, scopeLine: 422, flags: DIFlagPrototyped, isOptimized: false)
!319 = !DISubprogram(name: "SetupElementConnectivities", linkageName: "_ZN6Domain26SetupElementConnectivitiesEi", scope: !"_ZTS6Domain", file: !4, line: 423, type: !172, isLocal: false, isDefinition: false, scopeLine: 423, flags: DIFlagPrototyped, isOptimized: false)
!320 = !DISubprogram(name: "SetupBoundaryConditions", linkageName: "_ZN6Domain23SetupBoundaryConditionsEi", scope: !"_ZTS6Domain", file: !4, line: 424, type: !172, isLocal: false, isDefinition: false, scopeLine: 424, flags: DIFlagPrototyped, isOptimized: false)
!321 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<double, std::allocator<double> >", scope: !43, file: !322, line: 214, size: 192, align: 64, elements: !323, templateParams: !473, identifier: "_ZTSSt6vectorIdSaIdEE")
!322 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/5.3.0/../../../../include/c++/5.3.0/bits/stl_vector.h", directory: "/home/user1/devel/cxt-bitbucket/examples")
!323 = !{!324, !325, !329, !335, !344, !349, !350, !354, !357, !361, !366, !367, !368, !372, !376, !377, !378, !381, !382, !385, !386, !389, !392, !401, !409, !412, !413, !414, !417, !420, !421, !422, !430, !437, !440, !441, !444, !447, !450, !453, !456, !457, !458, !459, !460, !463, !468, !471, !472}
!324 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSSt6vectorIdSaIdEE", baseType: !"_ZTSSt12_Vector_baseIdSaIdEE", flags: DIFlagProtected)
!325 = !DISubprogram(name: "vector", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 253, type: !326, isLocal: false, isDefinition: false, scopeLine: 253, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!326 = !DISubroutineType(types: !327)
!327 = !{null, !328}
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSSt6vectorIdSaIdEE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!329 = !DISubprogram(name: "vector", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 264, type: !330, isLocal: false, isDefinition: false, scopeLine: 264, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: false)
!330 = !DISubroutineType(types: !331)
!331 = !{null, !328, !332}
!332 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !333, size: 64, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocator_type", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 238, baseType: !"_ZTSSaIdE")
!335 = !DISubprogram(name: "vector", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 303, type: !336, isLocal: false, isDefinition: false, scopeLine: 303, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: false)
!336 = !DISubroutineType(types: !337)
!337 = !{null, !328, !338, !341, !332}
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", file: !322, line: 236, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", scope: !43, file: !44, line: 196, baseType: !340)
!340 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!341 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !342, size: 64, align: 64)
!342 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "value_type", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 226, baseType: !118)
!344 = !DISubprogram(name: "vector", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 318, type: !345, isLocal: false, isDefinition: false, scopeLine: 318, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!345 = !DISubroutineType(types: !346)
!346 = !{null, !328, !347}
!347 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !348, size: 64, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSSt6vectorIdSaIdEE")
!349 = !DISubprogram(name: "~vector", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 423, type: !326, isLocal: false, isDefinition: false, scopeLine: 423, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!350 = !DISubprogram(name: "operator=", linkageName: "_ZNSt6vectorIdSaIdEEaSERKS1_", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 436, type: !351, isLocal: false, isDefinition: false, scopeLine: 436, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!351 = !DISubroutineType(types: !352)
!352 = !{!353, !328, !347}
!353 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSSt6vectorIdSaIdEE", size: 64, align: 64)
!354 = !DISubprogram(name: "assign", linkageName: "_ZNSt6vectorIdSaIdEE6assignEmRKd", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 488, type: !355, isLocal: false, isDefinition: false, scopeLine: 488, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!355 = !DISubroutineType(types: !356)
!356 = !{null, !328, !338, !341}
!357 = !DISubprogram(name: "begin", linkageName: "_ZNSt6vectorIdSaIdEE5beginEv", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 547, type: !358, isLocal: false, isDefinition: false, scopeLine: 547, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!358 = !DISubroutineType(types: !359)
!359 = !{!360, !328}
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "iterator", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 231, baseType: !"_ZTSN9__gnu_cxx17__normal_iteratorIPdSt6vectorIdSaIdEEEE")
!361 = !DISubprogram(name: "begin", linkageName: "_ZNKSt6vectorIdSaIdEE5beginEv", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 556, type: !362, isLocal: false, isDefinition: false, scopeLine: 556, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!362 = !DISubroutineType(types: !363)
!363 = !{!364, !365}
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_iterator", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 233, baseType: !"_ZTSN9__gnu_cxx17__normal_iteratorIPKdSt6vectorIdSaIdEEEE")
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!366 = !DISubprogram(name: "end", linkageName: "_ZNSt6vectorIdSaIdEE3endEv", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 565, type: !358, isLocal: false, isDefinition: false, scopeLine: 565, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!367 = !DISubprogram(name: "end", linkageName: "_ZNKSt6vectorIdSaIdEE3endEv", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 574, type: !362, isLocal: false, isDefinition: false, scopeLine: 574, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!368 = !DISubprogram(name: "rbegin", linkageName: "_ZNSt6vectorIdSaIdEE6rbeginEv", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 583, type: !369, isLocal: false, isDefinition: false, scopeLine: 583, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!369 = !DISubroutineType(types: !370)
!370 = !{!371, !328}
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "reverse_iterator", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 235, baseType: !"_ZTSSt16reverse_iteratorIN9__gnu_cxx17__normal_iteratorIPdSt6vectorIdSaIdEEEEE")
!372 = !DISubprogram(name: "rbegin", linkageName: "_ZNKSt6vectorIdSaIdEE6rbeginEv", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 592, type: !373, isLocal: false, isDefinition: false, scopeLine: 592, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!373 = !DISubroutineType(types: !374)
!374 = !{!375, !365}
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_reverse_iterator", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 234, baseType: !"_ZTSSt16reverse_iteratorIN9__gnu_cxx17__normal_iteratorIPKdSt6vectorIdSaIdEEEEE")
!376 = !DISubprogram(name: "rend", linkageName: "_ZNSt6vectorIdSaIdEE4rendEv", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 601, type: !369, isLocal: false, isDefinition: false, scopeLine: 601, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!377 = !DISubprogram(name: "rend", linkageName: "_ZNKSt6vectorIdSaIdEE4rendEv", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 610, type: !373, isLocal: false, isDefinition: false, scopeLine: 610, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!378 = !DISubprogram(name: "size", linkageName: "_ZNKSt6vectorIdSaIdEE4sizeEv", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 654, type: !379, isLocal: false, isDefinition: false, scopeLine: 654, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!379 = !DISubroutineType(types: !380)
!380 = !{!338, !365}
!381 = !DISubprogram(name: "max_size", linkageName: "_ZNKSt6vectorIdSaIdEE8max_sizeEv", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 659, type: !379, isLocal: false, isDefinition: false, scopeLine: 659, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!382 = !DISubprogram(name: "resize", linkageName: "_ZNSt6vectorIdSaIdEE6resizeEmd", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 713, type: !383, isLocal: false, isDefinition: false, scopeLine: 713, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!383 = !DISubroutineType(types: !384)
!384 = !{null, !328, !338, !343}
!385 = !DISubprogram(name: "capacity", linkageName: "_ZNKSt6vectorIdSaIdEE8capacityEv", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 734, type: !379, isLocal: false, isDefinition: false, scopeLine: 734, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!386 = !DISubprogram(name: "empty", linkageName: "_ZNKSt6vectorIdSaIdEE5emptyEv", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 743, type: !387, isLocal: false, isDefinition: false, scopeLine: 743, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!387 = !DISubroutineType(types: !388)
!388 = !{!51, !365}
!389 = !DISubprogram(name: "reserve", linkageName: "_ZNSt6vectorIdSaIdEE7reserveEm", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 764, type: !390, isLocal: false, isDefinition: false, scopeLine: 764, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!390 = !DISubroutineType(types: !391)
!391 = !{null, !328, !338}
!392 = !DISubprogram(name: "operator[]", linkageName: "_ZNSt6vectorIdSaIdEEixEm", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 779, type: !393, isLocal: false, isDefinition: false, scopeLine: 779, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!393 = !DISubroutineType(types: !394)
!394 = !{!395, !328, !338}
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "reference", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 229, baseType: !396)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "reference", scope: !"_ZTSN9__gnu_cxx14__alloc_traitsISaIdEEE", file: !397, line: 175, baseType: !398)
!397 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/5.3.0/../../../../include/c++/5.3.0/ext/alloc_traits.h", directory: "/home/user1/devel/cxt-bitbucket/examples")
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "reference", scope: !"_ZTSSaIdE", file: !399, line: 99, baseType: !400)
!399 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/5.3.0/../../../../include/c++/5.3.0/bits/allocator.h", directory: "/home/user1/devel/cxt-bitbucket/examples")
!400 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !118, size: 64, align: 64)
!401 = !DISubprogram(name: "operator[]", linkageName: "_ZNKSt6vectorIdSaIdEEixEm", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 794, type: !402, isLocal: false, isDefinition: false, scopeLine: 794, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!402 = !DISubroutineType(types: !403)
!403 = !{!404, !365, !338}
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_reference", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 230, baseType: !405)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_reference", scope: !"_ZTSN9__gnu_cxx14__alloc_traitsISaIdEEE", file: !397, line: 176, baseType: !406)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_reference", scope: !"_ZTSSaIdE", file: !399, line: 100, baseType: !407)
!407 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !408, size: 64, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!409 = !DISubprogram(name: "_M_range_check", linkageName: "_ZNKSt6vectorIdSaIdEE14_M_range_checkEm", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 800, type: !410, isLocal: false, isDefinition: false, scopeLine: 800, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: false)
!410 = !DISubroutineType(types: !411)
!411 = !{null, !365, !338}
!412 = !DISubprogram(name: "at", linkageName: "_ZNSt6vectorIdSaIdEE2atEm", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 822, type: !393, isLocal: false, isDefinition: false, scopeLine: 822, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!413 = !DISubprogram(name: "at", linkageName: "_ZNKSt6vectorIdSaIdEE2atEm", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 840, type: !402, isLocal: false, isDefinition: false, scopeLine: 840, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!414 = !DISubprogram(name: "front", linkageName: "_ZNSt6vectorIdSaIdEE5frontEv", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 851, type: !415, isLocal: false, isDefinition: false, scopeLine: 851, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!415 = !DISubroutineType(types: !416)
!416 = !{!395, !328}
!417 = !DISubprogram(name: "front", linkageName: "_ZNKSt6vectorIdSaIdEE5frontEv", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 859, type: !418, isLocal: false, isDefinition: false, scopeLine: 859, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!418 = !DISubroutineType(types: !419)
!419 = !{!404, !365}
!420 = !DISubprogram(name: "back", linkageName: "_ZNSt6vectorIdSaIdEE4backEv", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 867, type: !415, isLocal: false, isDefinition: false, scopeLine: 867, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!421 = !DISubprogram(name: "back", linkageName: "_ZNKSt6vectorIdSaIdEE4backEv", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 875, type: !418, isLocal: false, isDefinition: false, scopeLine: 875, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!422 = !DISubprogram(name: "data", linkageName: "_ZNSt6vectorIdSaIdEE4dataEv", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 890, type: !423, isLocal: false, isDefinition: false, scopeLine: 890, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!423 = !DISubroutineType(types: !424)
!424 = !{!425, !328}
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "pointer", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 227, baseType: !426)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "pointer", scope: !"_ZTSSt12_Vector_baseIdSaIdEE", file: !322, line: 77, baseType: !427)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "pointer", scope: !"_ZTSN9__gnu_cxx14__alloc_traitsISaIdEEE", file: !397, line: 172, baseType: !428)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "pointer", scope: !"_ZTSSaIdE", file: !399, line: 97, baseType: !429)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!430 = !DISubprogram(name: "data", linkageName: "_ZNKSt6vectorIdSaIdEE4dataEv", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 898, type: !431, isLocal: false, isDefinition: false, scopeLine: 898, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!431 = !DISubroutineType(types: !432)
!432 = !{!433, !365}
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_pointer", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 228, baseType: !434)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_pointer", scope: !"_ZTSN9__gnu_cxx14__alloc_traitsISaIdEEE", file: !397, line: 173, baseType: !435)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_pointer", scope: !"_ZTSSaIdE", file: !399, line: 98, baseType: !436)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64, align: 64)
!437 = !DISubprogram(name: "push_back", linkageName: "_ZNSt6vectorIdSaIdEE9push_backERKd", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 913, type: !438, isLocal: false, isDefinition: false, scopeLine: 913, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!438 = !DISubroutineType(types: !439)
!439 = !{null, !328, !341}
!440 = !DISubprogram(name: "pop_back", linkageName: "_ZNSt6vectorIdSaIdEE8pop_backEv", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 949, type: !326, isLocal: false, isDefinition: false, scopeLine: 949, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!441 = !DISubprogram(name: "insert", linkageName: "_ZNSt6vectorIdSaIdEE6insertEN9__gnu_cxx17__normal_iteratorIPdS1_EERKd", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 998, type: !442, isLocal: false, isDefinition: false, scopeLine: 998, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!442 = !DISubroutineType(types: !443)
!443 = !{!360, !328, !360, !341}
!444 = !DISubprogram(name: "insert", linkageName: "_ZNSt6vectorIdSaIdEE6insertEN9__gnu_cxx17__normal_iteratorIPdS1_EEmRKd", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 1072, type: !445, isLocal: false, isDefinition: false, scopeLine: 1072, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!445 = !DISubroutineType(types: !446)
!446 = !{null, !328, !360, !338, !341}
!447 = !DISubprogram(name: "erase", linkageName: "_ZNSt6vectorIdSaIdEE5eraseEN9__gnu_cxx17__normal_iteratorIPdS1_EE", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 1149, type: !448, isLocal: false, isDefinition: false, scopeLine: 1149, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!448 = !DISubroutineType(types: !449)
!449 = !{!360, !328, !360}
!450 = !DISubprogram(name: "erase", linkageName: "_ZNSt6vectorIdSaIdEE5eraseEN9__gnu_cxx17__normal_iteratorIPdS1_EES5_", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 1180, type: !451, isLocal: false, isDefinition: false, scopeLine: 1180, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!451 = !DISubroutineType(types: !452)
!452 = !{!360, !328, !360, !360}
!453 = !DISubprogram(name: "swap", linkageName: "_ZNSt6vectorIdSaIdEE4swapERS1_", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 1194, type: !454, isLocal: false, isDefinition: false, scopeLine: 1194, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!454 = !DISubroutineType(types: !455)
!455 = !{null, !328, !353}
!456 = !DISubprogram(name: "clear", linkageName: "_ZNSt6vectorIdSaIdEE5clearEv", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 1211, type: !326, isLocal: false, isDefinition: false, scopeLine: 1211, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!457 = !DISubprogram(name: "_M_fill_initialize", linkageName: "_ZNSt6vectorIdSaIdEE18_M_fill_initializeEmRKd", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 1298, type: !355, isLocal: false, isDefinition: false, scopeLine: 1298, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: false)
!458 = !DISubprogram(name: "_M_fill_assign", linkageName: "_ZNSt6vectorIdSaIdEE14_M_fill_assignEmRKd", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 1354, type: !355, isLocal: false, isDefinition: false, scopeLine: 1354, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: false)
!459 = !DISubprogram(name: "_M_fill_insert", linkageName: "_ZNSt6vectorIdSaIdEE14_M_fill_insertEN9__gnu_cxx17__normal_iteratorIPdS1_EEmRKd", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 1395, type: !445, isLocal: false, isDefinition: false, scopeLine: 1395, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: false)
!460 = !DISubprogram(name: "_M_insert_aux", linkageName: "_ZNSt6vectorIdSaIdEE13_M_insert_auxEN9__gnu_cxx17__normal_iteratorIPdS1_EERKd", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 1409, type: !461, isLocal: false, isDefinition: false, scopeLine: 1409, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: false)
!461 = !DISubroutineType(types: !462)
!462 = !{null, !328, !360, !341}
!463 = !DISubprogram(name: "_M_check_len", linkageName: "_ZNKSt6vectorIdSaIdEE12_M_check_lenEmPKc", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 1422, type: !464, isLocal: false, isDefinition: false, scopeLine: 1422, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: false)
!464 = !DISubroutineType(types: !465)
!465 = !{!338, !365, !338, !466}
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!468 = !DISubprogram(name: "_M_erase_at_end", linkageName: "_ZNSt6vectorIdSaIdEE15_M_erase_at_endEPd", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 1436, type: !469, isLocal: false, isDefinition: false, scopeLine: 1436, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: false)
!469 = !DISubroutineType(types: !470)
!470 = !{null, !328, !425}
!471 = !DISubprogram(name: "_M_erase", linkageName: "_ZNSt6vectorIdSaIdEE8_M_eraseEN9__gnu_cxx17__normal_iteratorIPdS1_EE", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 1443, type: !448, isLocal: false, isDefinition: false, scopeLine: 1443, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: false)
!472 = !DISubprogram(name: "_M_erase", linkageName: "_ZNSt6vectorIdSaIdEE8_M_eraseEN9__gnu_cxx17__normal_iteratorIPdS1_EES5_", scope: !"_ZTSSt6vectorIdSaIdEE", file: !322, line: 1446, type: !451, isLocal: false, isDefinition: false, scopeLine: 1446, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: false)
!473 = !{!474, !475}
!474 = !DITemplateTypeParameter(name: "_Tp", type: !118)
!475 = !DITemplateTypeParameter(name: "_Alloc", type: !"_ZTSSaIdE")
!476 = !DICompositeType(tag: DW_TAG_class_type, name: "allocator<double>", scope: !43, file: !399, line: 92, size: 8, align: 8, elements: !477, templateParams: !489, identifier: "_ZTSSaIdE")
!477 = !{!478, !479, !483, !488}
!478 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSSaIdE", baseType: !"_ZTSN9__gnu_cxx13new_allocatorIdEE", flags: DIFlagPublic)
!479 = !DISubprogram(name: "allocator", scope: !"_ZTSSaIdE", file: !399, line: 113, type: !480, isLocal: false, isDefinition: false, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!480 = !DISubroutineType(types: !481)
!481 = !{null, !482}
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSSaIdE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!483 = !DISubprogram(name: "allocator", scope: !"_ZTSSaIdE", file: !399, line: 115, type: !484, isLocal: false, isDefinition: false, scopeLine: 115, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!484 = !DISubroutineType(types: !485)
!485 = !{null, !482, !486}
!486 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !487, size: 64, align: 64)
!487 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSSaIdE")
!488 = !DISubprogram(name: "~allocator", scope: !"_ZTSSaIdE", file: !399, line: 121, type: !480, isLocal: false, isDefinition: false, scopeLine: 121, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!489 = !{!474}
!490 = !DICompositeType(tag: DW_TAG_class_type, name: "new_allocator<double>", scope: !492, file: !491, line: 58, size: 8, align: 8, elements: !493, templateParams: !489, identifier: "_ZTSN9__gnu_cxx13new_allocatorIdEE")
!491 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/5.3.0/../../../../include/c++/5.3.0/ext/new_allocator.h", directory: "/home/user1/devel/cxt-bitbucket/examples")
!492 = !DINamespace(name: "__gnu_cxx", scope: null, file: !9, line: 68)
!493 = !{!494, !498, !503, !504, !510, !515, !521, !524, !527, !530}
!494 = !DISubprogram(name: "new_allocator", scope: !"_ZTSN9__gnu_cxx13new_allocatorIdEE", file: !491, line: 79, type: !495, isLocal: false, isDefinition: false, scopeLine: 79, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!495 = !DISubroutineType(types: !496)
!496 = !{null, !497}
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN9__gnu_cxx13new_allocatorIdEE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!498 = !DISubprogram(name: "new_allocator", scope: !"_ZTSN9__gnu_cxx13new_allocatorIdEE", file: !491, line: 81, type: !499, isLocal: false, isDefinition: false, scopeLine: 81, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!499 = !DISubroutineType(types: !500)
!500 = !{null, !497, !501}
!501 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !502, size: 64, align: 64)
!502 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN9__gnu_cxx13new_allocatorIdEE")
!503 = !DISubprogram(name: "~new_allocator", scope: !"_ZTSN9__gnu_cxx13new_allocatorIdEE", file: !491, line: 86, type: !495, isLocal: false, isDefinition: false, scopeLine: 86, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!504 = !DISubprogram(name: "address", linkageName: "_ZNK9__gnu_cxx13new_allocatorIdE7addressERd", scope: !"_ZTSN9__gnu_cxx13new_allocatorIdEE", file: !491, line: 89, type: !505, isLocal: false, isDefinition: false, scopeLine: 89, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!505 = !DISubroutineType(types: !506)
!506 = !{!507, !508, !509}
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "pointer", scope: !"_ZTSN9__gnu_cxx13new_allocatorIdEE", file: !491, line: 63, baseType: !429)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "reference", scope: !"_ZTSN9__gnu_cxx13new_allocatorIdEE", file: !491, line: 65, baseType: !400)
!510 = !DISubprogram(name: "address", linkageName: "_ZNK9__gnu_cxx13new_allocatorIdE7addressERKd", scope: !"_ZTSN9__gnu_cxx13new_allocatorIdEE", file: !491, line: 93, type: !511, isLocal: false, isDefinition: false, scopeLine: 93, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!511 = !DISubroutineType(types: !512)
!512 = !{!513, !508, !514}
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_pointer", scope: !"_ZTSN9__gnu_cxx13new_allocatorIdEE", file: !491, line: 64, baseType: !436)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_reference", scope: !"_ZTSN9__gnu_cxx13new_allocatorIdEE", file: !491, line: 66, baseType: !407)
!515 = !DISubprogram(name: "allocate", linkageName: "_ZN9__gnu_cxx13new_allocatorIdE8allocateEmPKv", scope: !"_ZTSN9__gnu_cxx13new_allocatorIdEE", file: !491, line: 99, type: !516, isLocal: false, isDefinition: false, scopeLine: 99, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!516 = !DISubroutineType(types: !517)
!517 = !{!507, !497, !518, !519}
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", file: !491, line: 61, baseType: !339)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64, align: 64)
!520 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!521 = !DISubprogram(name: "deallocate", linkageName: "_ZN9__gnu_cxx13new_allocatorIdE10deallocateEPdm", scope: !"_ZTSN9__gnu_cxx13new_allocatorIdEE", file: !491, line: 109, type: !522, isLocal: false, isDefinition: false, scopeLine: 109, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!522 = !DISubroutineType(types: !523)
!523 = !{null, !497, !507, !518}
!524 = !DISubprogram(name: "max_size", linkageName: "_ZNK9__gnu_cxx13new_allocatorIdE8max_sizeEv", scope: !"_ZTSN9__gnu_cxx13new_allocatorIdEE", file: !491, line: 113, type: !525, isLocal: false, isDefinition: false, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!525 = !DISubroutineType(types: !526)
!526 = !{!518, !508}
!527 = !DISubprogram(name: "construct", linkageName: "_ZN9__gnu_cxx13new_allocatorIdE9constructEPdRKd", scope: !"_ZTSN9__gnu_cxx13new_allocatorIdEE", file: !491, line: 129, type: !528, isLocal: false, isDefinition: false, scopeLine: 129, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!528 = !DISubroutineType(types: !529)
!529 = !{null, !497, !507, !407}
!530 = !DISubprogram(name: "destroy", linkageName: "_ZN9__gnu_cxx13new_allocatorIdE7destroyEPd", scope: !"_ZTSN9__gnu_cxx13new_allocatorIdEE", file: !491, line: 133, type: !531, isLocal: false, isDefinition: false, scopeLine: 133, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!531 = !DISubroutineType(types: !532)
!532 = !{null, !497, !507}
!533 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Vector_base<double, std::allocator<double> >", scope: !43, file: !322, line: 72, size: 192, align: 64, elements: !534, templateParams: !473, identifier: "_ZTSSt12_Vector_baseIdSaIdEE")
!534 = !{!535, !536, !544, !551, !555, !558, !563, !566, !569, !570, !573, !576}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_M_impl", scope: !"_ZTSSt12_Vector_baseIdSaIdEE", file: !322, line: 164, baseType: !"_ZTSNSt12_Vector_baseIdSaIdEE12_Vector_implE", size: 192, align: 64)
!536 = !DISubprogram(name: "_M_get_Tp_allocator", linkageName: "_ZNSt12_Vector_baseIdSaIdEE19_M_get_Tp_allocatorEv", scope: !"_ZTSSt12_Vector_baseIdSaIdEE", file: !322, line: 113, type: !537, isLocal: false, isDefinition: false, scopeLine: 113, flags: DIFlagPrototyped, isOptimized: false)
!537 = !DISubroutineType(types: !538)
!538 = !{!539, !543}
!539 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !540, size: 64, align: 64)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Tp_alloc_type", scope: !"_ZTSSt12_Vector_baseIdSaIdEE", file: !322, line: 75, baseType: !541)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "other", scope: !"_ZTSN9__gnu_cxx14__alloc_traitsISaIdEE6rebindIdEE", file: !397, line: 208, baseType: !542)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "other", scope: !"_ZTSNSaIdE6rebindIdEE", file: !399, line: 105, baseType: !"_ZTSSaIdE")
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSSt12_Vector_baseIdSaIdEE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!544 = !DISubprogram(name: "_M_get_Tp_allocator", linkageName: "_ZNKSt12_Vector_baseIdSaIdEE19_M_get_Tp_allocatorEv", scope: !"_ZTSSt12_Vector_baseIdSaIdEE", file: !322, line: 117, type: !545, isLocal: false, isDefinition: false, scopeLine: 117, flags: DIFlagPrototyped, isOptimized: false)
!545 = !DISubroutineType(types: !546)
!546 = !{!547, !549}
!547 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !548, size: 64, align: 64)
!548 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !540)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!550 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSSt12_Vector_baseIdSaIdEE")
!551 = !DISubprogram(name: "get_allocator", linkageName: "_ZNKSt12_Vector_baseIdSaIdEE13get_allocatorEv", scope: !"_ZTSSt12_Vector_baseIdSaIdEE", file: !322, line: 121, type: !552, isLocal: false, isDefinition: false, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false)
!552 = !DISubroutineType(types: !553)
!553 = !{!554, !549}
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocator_type", scope: !"_ZTSSt12_Vector_baseIdSaIdEE", file: !322, line: 110, baseType: !"_ZTSSaIdE")
!555 = !DISubprogram(name: "_Vector_base", scope: !"_ZTSSt12_Vector_baseIdSaIdEE", file: !322, line: 124, type: !556, isLocal: false, isDefinition: false, scopeLine: 124, flags: DIFlagPrototyped, isOptimized: false)
!556 = !DISubroutineType(types: !557)
!557 = !{null, !543}
!558 = !DISubprogram(name: "_Vector_base", scope: !"_ZTSSt12_Vector_baseIdSaIdEE", file: !322, line: 127, type: !559, isLocal: false, isDefinition: false, scopeLine: 127, flags: DIFlagPrototyped, isOptimized: false)
!559 = !DISubroutineType(types: !560)
!560 = !{null, !543, !561}
!561 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !562, size: 64, align: 64)
!562 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !554)
!563 = !DISubprogram(name: "_Vector_base", scope: !"_ZTSSt12_Vector_baseIdSaIdEE", file: !322, line: 130, type: !564, isLocal: false, isDefinition: false, scopeLine: 130, flags: DIFlagPrototyped, isOptimized: false)
!564 = !DISubroutineType(types: !565)
!565 = !{null, !543, !339}
!566 = !DISubprogram(name: "_Vector_base", scope: !"_ZTSSt12_Vector_baseIdSaIdEE", file: !322, line: 134, type: !567, isLocal: false, isDefinition: false, scopeLine: 134, flags: DIFlagPrototyped, isOptimized: false)
!567 = !DISubroutineType(types: !568)
!568 = !{null, !543, !339, !561}
!569 = !DISubprogram(name: "~_Vector_base", scope: !"_ZTSSt12_Vector_baseIdSaIdEE", file: !322, line: 159, type: !556, isLocal: false, isDefinition: false, scopeLine: 159, flags: DIFlagPrototyped, isOptimized: false)
!570 = !DISubprogram(name: "_M_allocate", linkageName: "_ZNSt12_Vector_baseIdSaIdEE11_M_allocateEm", scope: !"_ZTSSt12_Vector_baseIdSaIdEE", file: !322, line: 167, type: !571, isLocal: false, isDefinition: false, scopeLine: 167, flags: DIFlagPrototyped, isOptimized: false)
!571 = !DISubroutineType(types: !572)
!572 = !{!426, !543, !339}
!573 = !DISubprogram(name: "_M_deallocate", linkageName: "_ZNSt12_Vector_baseIdSaIdEE13_M_deallocateEPdm", scope: !"_ZTSSt12_Vector_baseIdSaIdEE", file: !322, line: 174, type: !574, isLocal: false, isDefinition: false, scopeLine: 174, flags: DIFlagPrototyped, isOptimized: false)
!574 = !DISubroutineType(types: !575)
!575 = !{null, !543, !426, !339}
!576 = !DISubprogram(name: "_M_create_storage", linkageName: "_ZNSt12_Vector_baseIdSaIdEE17_M_create_storageEm", scope: !"_ZTSSt12_Vector_baseIdSaIdEE", file: !322, line: 183, type: !564, isLocal: false, isDefinition: false, scopeLine: 183, flags: DIFlagPrivate | DIFlagPrototyped, isOptimized: false)
!577 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Vector_impl", scope: !"_ZTSSt12_Vector_baseIdSaIdEE", file: !322, line: 79, size: 192, align: 64, elements: !578, identifier: "_ZTSNSt12_Vector_baseIdSaIdEE12_Vector_implE")
!578 = !{!579, !580, !581, !582, !583, !587, !590}
!579 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSNSt12_Vector_baseIdSaIdEE12_Vector_implE", baseType: !540)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_M_start", scope: !"_ZTSNSt12_Vector_baseIdSaIdEE12_Vector_implE", file: !322, line: 82, baseType: !426, size: 64, align: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_M_finish", scope: !"_ZTSNSt12_Vector_baseIdSaIdEE12_Vector_implE", file: !322, line: 83, baseType: !426, size: 64, align: 64, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_M_end_of_storage", scope: !"_ZTSNSt12_Vector_baseIdSaIdEE12_Vector_implE", file: !322, line: 84, baseType: !426, size: 64, align: 64, offset: 128)
!583 = !DISubprogram(name: "_Vector_impl", scope: !"_ZTSNSt12_Vector_baseIdSaIdEE12_Vector_implE", file: !322, line: 86, type: !584, isLocal: false, isDefinition: false, scopeLine: 86, flags: DIFlagPrototyped, isOptimized: false)
!584 = !DISubroutineType(types: !585)
!585 = !{null, !586}
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt12_Vector_baseIdSaIdEE12_Vector_implE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!587 = !DISubprogram(name: "_Vector_impl", scope: !"_ZTSNSt12_Vector_baseIdSaIdEE12_Vector_implE", file: !322, line: 90, type: !588, isLocal: false, isDefinition: false, scopeLine: 90, flags: DIFlagPrototyped, isOptimized: false)
!588 = !DISubroutineType(types: !589)
!589 = !{null, !586, !547}
!590 = !DISubprogram(name: "_M_swap_data", linkageName: "_ZNSt12_Vector_baseIdSaIdEE12_Vector_impl12_M_swap_dataERS2_", scope: !"_ZTSNSt12_Vector_baseIdSaIdEE12_Vector_implE", file: !322, line: 101, type: !591, isLocal: false, isDefinition: false, scopeLine: 101, flags: DIFlagPrototyped, isOptimized: false)
!591 = !DISubroutineType(types: !592)
!592 = !{null, !586, !593}
!593 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSNSt12_Vector_baseIdSaIdEE12_Vector_implE", size: 64, align: 64)
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "__alloc_traits<std::allocator<double> >", scope: !492, file: !397, line: 95, size: 8, align: 8, elements: !595, templateParams: !617, identifier: "_ZTSN9__gnu_cxx14__alloc_traitsISaIdEEE")
!595 = !{!596, !602, !605, !608, !611, !614}
!596 = !DISubprogram(name: "allocate", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIdEE8allocateERS1_m", scope: !"_ZTSN9__gnu_cxx14__alloc_traitsISaIdEEE", file: !397, line: 181, type: !597, isLocal: false, isDefinition: false, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: false)
!597 = !DISubroutineType(types: !598)
!598 = !{!427, !599, !600}
!599 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSSaIdE", size: 64, align: 64)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", scope: !"_ZTSN9__gnu_cxx14__alloc_traitsISaIdEEE", file: !397, line: 177, baseType: !601)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", scope: !"_ZTSSaIdE", file: !399, line: 95, baseType: !339)
!602 = !DISubprogram(name: "deallocate", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIdEE10deallocateERS1_Pdm", scope: !"_ZTSN9__gnu_cxx14__alloc_traitsISaIdEEE", file: !397, line: 184, type: !603, isLocal: false, isDefinition: false, scopeLine: 184, flags: DIFlagPrototyped, isOptimized: false)
!603 = !DISubroutineType(types: !604)
!604 = !{null, !599, !427, !600}
!605 = !DISubprogram(name: "destroy", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIdEE7destroyERS1_Pd", scope: !"_ZTSN9__gnu_cxx14__alloc_traitsISaIdEEE", file: !397, line: 191, type: !606, isLocal: false, isDefinition: false, scopeLine: 191, flags: DIFlagPrototyped, isOptimized: false)
!606 = !DISubroutineType(types: !607)
!607 = !{null, !599, !427}
!608 = !DISubprogram(name: "max_size", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIdEE8max_sizeERKS1_", scope: !"_ZTSN9__gnu_cxx14__alloc_traitsISaIdEEE", file: !397, line: 194, type: !609, isLocal: false, isDefinition: false, scopeLine: 194, flags: DIFlagPrototyped, isOptimized: false)
!609 = !DISubroutineType(types: !610)
!610 = !{!600, !486}
!611 = !DISubprogram(name: "_S_select_on_copy", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIdEE17_S_select_on_copyERKS1_", scope: !"_ZTSN9__gnu_cxx14__alloc_traitsISaIdEEE", file: !397, line: 197, type: !612, isLocal: false, isDefinition: false, scopeLine: 197, flags: DIFlagPrototyped, isOptimized: false)
!612 = !DISubroutineType(types: !613)
!613 = !{!486, !486}
!614 = !DISubprogram(name: "_S_on_swap", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIdEE10_S_on_swapERS1_S3_", scope: !"_ZTSN9__gnu_cxx14__alloc_traitsISaIdEEE", file: !397, line: 199, type: !615, isLocal: false, isDefinition: false, scopeLine: 199, flags: DIFlagPrototyped, isOptimized: false)
!615 = !DISubroutineType(types: !616)
!616 = !{null, !599, !599}
!617 = !{!475}
!618 = !DICompositeType(tag: DW_TAG_structure_type, name: "rebind<double>", scope: !"_ZTSN9__gnu_cxx14__alloc_traitsISaIdEEE", file: !397, line: 207, size: 8, align: 8, elements: !619, templateParams: !489, identifier: "_ZTSN9__gnu_cxx14__alloc_traitsISaIdEE6rebindIdEE")
!619 = !{}
!620 = !DICompositeType(tag: DW_TAG_structure_type, name: "rebind<double>", scope: !"_ZTSSaIdE", file: !399, line: 104, size: 8, align: 8, elements: !619, templateParams: !621, identifier: "_ZTSNSaIdE6rebindIdEE")
!621 = !{!622}
!622 = !DITemplateTypeParameter(name: "_Tp1", type: !118)
!623 = !DICompositeType(tag: DW_TAG_class_type, name: "__normal_iterator<double *, std::vector<double, std::allocator<double> > >", scope: !492, file: !624, line: 721, size: 64, align: 64, elements: !625, templateParams: !676, identifier: "_ZTSN9__gnu_cxx17__normal_iteratorIPdSt6vectorIdSaIdEEEE")
!624 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/5.3.0/../../../../include/c++/5.3.0/bits/stl_iterator.h", directory: "/home/user1/devel/cxt-bitbucket/examples")
!625 = !{!626, !627, !631, !636, !644, !649, !653, !656, !657, !658, !665, !668, !671, !672, !673}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_M_current", scope: !"_ZTSN9__gnu_cxx17__normal_iteratorIPdSt6vectorIdSaIdEEEE", file: !624, line: 724, baseType: !429, size: 64, align: 64, flags: DIFlagProtected)
!627 = !DISubprogram(name: "__normal_iterator", scope: !"_ZTSN9__gnu_cxx17__normal_iteratorIPdSt6vectorIdSaIdEEEE", file: !624, line: 736, type: !628, isLocal: false, isDefinition: false, scopeLine: 736, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!628 = !DISubroutineType(types: !629)
!629 = !{null, !630}
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN9__gnu_cxx17__normal_iteratorIPdSt6vectorIdSaIdEEEE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!631 = !DISubprogram(name: "__normal_iterator", scope: !"_ZTSN9__gnu_cxx17__normal_iteratorIPdSt6vectorIdSaIdEEEE", file: !624, line: 740, type: !632, isLocal: false, isDefinition: false, scopeLine: 740, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: false)
!632 = !DISubroutineType(types: !633)
!633 = !{null, !630, !634}
!634 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !635, size: 64, align: 64)
!635 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !429)
!636 = !DISubprogram(name: "operator*", linkageName: "_ZNK9__gnu_cxx17__normal_iteratorIPdSt6vectorIdSaIdEEEdeEv", scope: !"_ZTSN9__gnu_cxx17__normal_iteratorIPdSt6vectorIdSaIdEEEE", file: !624, line: 753, type: !637, isLocal: false, isDefinition: false, scopeLine: 753, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!637 = !DISubroutineType(types: !638)
!638 = !{!639, !642}
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "reference", scope: !"_ZTSN9__gnu_cxx17__normal_iteratorIPdSt6vectorIdSaIdEEEE", file: !624, line: 733, baseType: !640)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "reference", scope: !"_ZTSSt15iterator_traitsIPdE", file: !641, line: 184, baseType: !400)
!641 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/5.3.0/../../../../include/c++/5.3.0/bits/stl_iterator_base_types.h", directory: "/home/user1/devel/cxt-bitbucket/examples")
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!643 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN9__gnu_cxx17__normal_iteratorIPdSt6vectorIdSaIdEEEE")
!644 = !DISubprogram(name: "operator->", linkageName: "_ZNK9__gnu_cxx17__normal_iteratorIPdSt6vectorIdSaIdEEEptEv", scope: !"_ZTSN9__gnu_cxx17__normal_iteratorIPdSt6vectorIdSaIdEEEE", file: !624, line: 757, type: !645, isLocal: false, isDefinition: false, scopeLine: 757, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!645 = !DISubroutineType(types: !646)
!646 = !{!647, !642}
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "pointer", scope: !"_ZTSN9__gnu_cxx17__normal_iteratorIPdSt6vectorIdSaIdEEEE", file: !624, line: 734, baseType: !648)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "pointer", scope: !"_ZTSSt15iterator_traitsIPdE", file: !641, line: 183, baseType: !429)
!649 = !DISubprogram(name: "operator++", linkageName: "_ZN9__gnu_cxx17__normal_iteratorIPdSt6vectorIdSaIdEEEppEv", scope: !"_ZTSN9__gnu_cxx17__normal_iteratorIPdSt6vectorIdSaIdEEEE", file: !624, line: 761, type: !650, isLocal: false, isDefinition: false, scopeLine: 761, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!650 = !DISubroutineType(types: !651)
!651 = !{!652, !630}
!652 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN9__gnu_cxx17__normal_iteratorIPdSt6vectorIdSaIdEEEE", size: 64, align: 64)
!653 = !DISubprogram(name: "operator++", linkageName: "_ZN9__gnu_cxx17__normal_iteratorIPdSt6vectorIdSaIdEEEppEi", scope: !"_ZTSN9__gnu_cxx17__normal_iteratorIPdSt6vectorIdSaIdEEEE", file: !624, line: 768, type: !654, isLocal: false, isDefinition: false, scopeLine: 768, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!654 = !DISubroutineType(types: !655)
!655 = !{!"_ZTSN9__gnu_cxx17__normal_iteratorIPdSt6vectorIdSaIdEEEE", !630, !17}
!656 = !DISubprogram(name: "operator--", linkageName: "_ZN9__gnu_cxx17__normal_iteratorIPdSt6vectorIdSaIdEEEmmEv", scope: !"_ZTSN9__gnu_cxx17__normal_iteratorIPdSt6vectorIdSaIdEEEE", file: !624, line: 773, type: !650, isLocal: false, isDefinition: false, scopeLine: 773, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!657 = !DISubprogram(name: "operator--", linkageName: "_ZN9__gnu_cxx17__normal_iteratorIPdSt6vectorIdSaIdEEEmmEi", scope: !"_ZTSN9__gnu_cxx17__normal_iteratorIPdSt6vectorIdSaIdEEEE", file: !624, line: 780, type: !654, isLocal: false, isDefinition: false, scopeLine: 780, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!658 = !DISubprogram(name: "operator[]", linkageName: "_ZNK9__gnu_cxx17__normal_iteratorIPdSt6vectorIdSaIdEEEixEl", scope: !"_ZTSN9__gnu_cxx17__normal_iteratorIPdSt6vectorIdSaIdEEEE", file: !624, line: 785, type: !659, isLocal: false, isDefinition: false, scopeLine: 785, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!659 = !DISubroutineType(types: !660)
!660 = !{!639, !642, !661}
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "difference_type", scope: !"_ZTSN9__gnu_cxx17__normal_iteratorIPdSt6vectorIdSaIdEEEE", file: !624, line: 732, baseType: !662)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "difference_type", scope: !"_ZTSSt15iterator_traitsIPdE", file: !641, line: 182, baseType: !663)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", scope: !43, file: !44, line: 197, baseType: !664)
!664 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!665 = !DISubprogram(name: "operator+=", linkageName: "_ZN9__gnu_cxx17__normal_iteratorIPdSt6vectorIdSaIdEEEpLEl", scope: !"_ZTSN9__gnu_cxx17__normal_iteratorIPdSt6vectorIdSaIdEEEE", file: !624, line: 789, type: !666, isLocal: false, isDefinition: false, scopeLine: 789, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!666 = !DISubroutineType(types: !667)
!667 = !{!652, !630, !661}
